print("+--------------------------------------------------+\n| Электронный лабораторный журнал                  |\n+--------------------------------------------------+")
fio = input("| ФИО исследователя : ")
date = input("| Дата             : ")
name = input("| Эксперимент      : ")
output = input("+--------------------------------------------------+\n| Вывод:                                           |")

with open("C:/Users/Иван/OneDrive/Документы/sumenkov.ia/projects_2/task_2_3/journal.txt", "w", encoding="utf-8") as card:
    
    print(f"+--------------------------------------------------+\n| Электронный лабораторный журнал                  |\n+--------------------------------------------------+\n{fio}         |\n{name}                    |\n{date}     |\n+--------------------------------------------------+\n| Вывод:                                           |\n|{output}|\n+--------------------------------------------------+")
    card.write(f"+--------------------------------------------------+\n| Электронный лабораторный журнал                  |\n+--------------------------------------------------+\n{fio}         |\n{name}                    |\n{date}     |\n+--------------------------------------------------+\n| Вывод:                                           |\n|{output}|\n+--------------------------------------------------+")
